lab 3/Ruby-on-Rails-ITI/app/controllers/authors_controller.rb

INSERT INTO "authors" ("name", "created_at", "updated_at") VALUES (?, ?, ?) RETURNING "id"  [["name", "menna"], ["created_at", "2024-05-02 21:00:45.440817"], ["updated_at", "2024-05-02 21:00:45.440817"]]
---
  def create
    @author = Author.new(author_params)

    if @author.save