lab 3/Ruby-on-Rails-ITI/app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "content", "author_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["title", "post 1"], ["content", "content 1"], ["author_id", 1], ["created_at", "2024-05-02 21:01:06.191287"], ["updated_at", "2024-05-02 21:01:06.191287"]]
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save